<template>
    <div class="wrapper__conditions">
      <el-scrollbar>
      <p :style="{fontSize: 10 + 'px'}">
        {{ paragraph }}
      </p>
      </el-scrollbar>
      
      <ModalErrorxID title="xIDでログインできません" />

    </div>
</template>

<script setup lang="ts">
import ModalErrorxID from './ModalErrorxID.vue'
let paragraph = 
`本利用規約（以下「本規約」といいます。）には、当社が提供する本サービスの利用条件および当社と利用者との間の権利義務関係が定められています。本サービスの利用に際しては、本規約の全文をお読みいただいたうえで、本規約に同意いただく必要があります。

1.（適用）
1. 本規約は、本サービス（第2条に定義。）の提供条件および本サービスの利用に関する当社と利用者との間の権利義務関係を定めることを目的とし、利用者と当社との間の本サービスの利用に関わる一切の関係に適用されます。
2. 当社が当社ウェブサイト（第2条に定義。）上または本アプリ（第2条に定義。）内に掲載する本サービス利用に関するルール、個別規定および追加規定等は、本規約の一部を構成するものとします。
3. 本規約の内容と、前項のルール、個別規定および追加規定等、その他の本規約外における本サービスの説明等とが異なる場合は、本規約の規定が優先して適用されるものとします。

2.（定義）
本規約において使用する以下の用語は、各々以下に定める意味を有するものとします。

1. 「サービス利用契約」とは、本規約を契約条件として当社と利用者の間で締結される、本サービスの利用契約を意味します。
2. 「知的財産権」とは、著作権、特許権、実用新案権、意匠権、商標権その他の知的財産権（それらの権利を取得し、またはそれらの権利につき登録等を出願する権利を含みます。）を意味します。
3. 「当社」とは、xID株式会社を意味します。
4. 「当社ウェブサイト」とは、そのドメインが「x-id.me」または「x-id.io」等当社が運営するウェブサイト（理由の如何を問わず、当社のウェブサイトのドメインまたは内容が変更された場合は、当該変更後のウェブサイトを含みます。）を意味します。
5. 「利用者」とは、第3条（利用手続）に基づいて本サービスの利用者としての登録がなされた個人を意味します。
6. 「利用希望者」とは、本サービスの利用を希望する個人を意味します。
7. 「本アプリ」とは、当社が開発し、App StoreまたはGoogle Playから利用者に対して提供するデジタル身分証アプリ「xID」（理由の如何を問わずアプリの名称または内容が変更された場合は、当該変更後のアプリを含みます。）を意味します。
8. 「本サービス」とは、当社が運営し、本アプリを介して利用者に提供する「xID」という名称のサービス（理由の如何を問わずサービスの名称または内容が変更された場合は、当該変更後のサービスを含みます。）を意味します。
9. 「個人情報」とは、個人情報の保護に関する法律（平成15年5月30日法律第57号。）第2条に定める個人情報を意味します。
10. 「利用者登録情報」とは、利用者の個人情報、本人確認書類、その記載事項その他の利用者が本サービスに登録した情報の総称を意味します。
11. 「提携事業者」とは、利用者がそのサービスを利用しようとしている、当社が当人認証、本人確認または電子署名についての提携を行う企業等の法人、地方公共団体またはその機関、国、その他の事業者を意味します。
12. 「身元識別情報」とは、当社が定める方法によって個人等を一意に識別する情報をいいます。
13. 「当人認証」とは、当社のサービスの利用開始に際し、または提携事業者のサービスの利用開始に際して当該提携事業者が委託しもしくは提携によって当社が実施する、当該サービスを利用しようとする者と身元識別情報との同一性を検証することによって、当該サービスを利用しようとする者が身元識別情報にあらかじめ関連付けられた者であることの信用を確立するプロセスを意味します。
14. 「身元確認」とは、当社のサービスの利用開始に際し、または提携事業者のサービスの利用開始に際して当該提携事業者が委託しもしくは提携によって当社が実施する、当該サービスを利用しようとする者の氏名等を確認するプロセスを意味します。
15. 「本人確認」とは、当社のサービスの利用開始によってまたは提携事業者のサービスの利用開始に際して当該提携事業者が委託しもしくは提携によって当社が実施する、身元識別情報または身元確認を用いる方法その他提携事業者および当社が定める方法による本人確認を意味します。
16. 「電子署名」とは、電子署名及び認証業務に関する法律（平成12年法律第102号。）第2条に定める電子署名をいいます。
17. 「署名用電子証明書」とは、マイナンバーカードに格納され、当人認証や本人確認において利用者本人であることの証明に用いる電子証明書をいいます。
18. 「機構」とは、地方公共団体情報システム機構を意味します。
19. 「プラットフォーム事業者」とは、電子署名等に係る地方公共団体システム機構の認証業務に関する法律（平成14年法律第153号。以下事項において「公的個人認証法」という）第17条1項6号の規定により総務大臣認定を受けた者をいいます。
    1. 当社は、株式会社NTTデータをプラットフォーム事業者として、利用者に係る電子署名確認業務（公的個人認証法第17条1項6号に規定する確認の業務をいう。以下同じ。）の全部を委託しています。
20. 「認証業務情報」とは、公的個人認証法第44条に規定する認証業務情報をいいます。
21. 「認証局」とは、本サービスの一部として当社が運営する電子証明書の認証局（Certificate Authority）をいいます。
22. 「xID電子証明書」とは、当社が運営する認証局が発行する電子証明書であり、その用途を認証用と署名用とするそれぞれの電子証明書をいいます。
23. 「秘密鍵の一部」とは、xID電子証明書の発行に係る秘密鍵を数学的計算によって2つに分割をしたうちの1つをいいます。

# **3.（利用手続等）**

1. 利用希望者は、本規約を遵守することに同意したうえで、本アプリの案内に従い、当社の定める一定の情報を当社の定める方法で当社に提供することにより、本サービスの利用開始を申込むことができます。
2. 前項に定める本サービスの利用開始の申込完了時に、当該申込を行った利用希望者は、第1条に基づき適用される本規約等のすべてを変更なく受け入れ同意したものとし、当社による利用規約の承認をもってサービス利用契約が利用者と当社の間に成立し、利用者は本サービスを本規約に従い利用することができるようになります。
3. 当社は、利用希望者が、以下の各号のいずれかの事由に該当する場合は、登録および変更・更新の手続きを拒否することがあり、またその理由について一切開示義務を負いません。また、利用開始の承認後において、利用者が以下の各号のいずれかの事由に該当することが判明した場合には、本サービスの全部または一部の提供を停止し、またはサービス利用契約を解約することがあります。
    1. 当社に提供した利用者登録情報の全部または一部につき虚偽、誤記または記載漏れがあった場合
    2. 未成年者、成年被後見人、被保佐人または被補助人のいずれかであり、法定代理人、後見人、保佐人または補助人の同意等を得ていなかった場合
    3. 暴力団、暴力団員、暴力団員でなくなったときから5年を経過しない者、暴力団準構成員、暴力団関係企業、総会屋等、社会運動標ぼうゴロまたは特殊知能暴力集団等、その他これらに準ずるもの（以下「反社会的勢力等」といいます。）である、または資金提供その他を通じて反社会的勢力等の維持、運営もしくは経営に協力もしくは関与する等反社会的勢力等との何らかの交流もしくは関与を行っていると当社が判断した場合
    4. 過去当社との契約に違反した者またはその関係者であると当社が判断した場合
    5. 第9条に定める措置を受けたことがある場合
    6. その他、登録を適当でないと当社が判断した場合
4. 利用者は、本サービスを利用する場合、提携事業者が提示する規約その他の提携事業者のサービスの利用について適用される利用条件に同意のうえ、これに従うものとします。
5. 利用者は、本サービスにアカウント登録、本人確認などを実施する際、当社に対して、次に掲げる事項について同意したものとみなします。
    1. 認証局が、本サービスで利用される当該利用者のxID電子証明書の発行を行うこと。
    2. 当社が、プラットフォーム事業者に対して署名用電子証明書の有効性確認を委託すること。
    3. 当社が、前号の規定による有効性確認に係る認証業務情報の確認を電磁的記録により行うこと。
    4. 当社が、本項1号の規定による有効性確認の実施において、利用者から署名用電子証明書および当該署名用電子証明書による電子署名の送信を受けること。
    5. 当社が、本項1号の規定による有効性確認の実施において、利用者から受領した署名用電子証明書および当該署名用電子証明書による電子署名をプラットフォーム事業者に対して送信すること。
    6. 当社が、プラットフォーム事業者から署名用電子証明書の有効性確認の結果に基づいてプラットフォーム事業者が独自に生成したIDを受領すること。
    7. 利用者が、本サービスのアカウント登録、本人確認を実施することで、認証局に対して電子証明書の発行申請を行うこと。
    8. 本サービスの利用手続きの完了を以って、認証局から発行された電子証明書を受領したものとすること。
    9. 利用者が、認証局から発行された利用者の電子証明書を本サービスに預託すること。
    10. 利用者が、利用者の電子証明書の発行に係る秘密鍵の一部を本サービスに預託すること。
    11. 当社が、当社の定める認証局の運用規定（xID Certificate Authority 認証局運用規定：[https://repository.x-id.io/ca/cps.pdf](https://repository.x-id.io/ca/cps.pdf)）に従って、利用者の電子証明書を取り扱うことについて同意するものとすること。
6. 利用者は、本サービスにアカウント登録、本人確認などを実施する際、プラットフォーム事業者に対して、次に掲げる事項について同意したものとみなします。
    1. プラットフォーム事業者が、前項1号の規定による有効性確認を実施すること。
    2. プラットフォーム事業者が、前項1号の規定による有効性確認に係る認証業務情報の確認を電磁的記録により行うこと。
    3. プラットフォーム事業者が、機構に対して、前項1号の規定による有効性確認に係る利用者の署名用電子証明書の発行番号を送信すること。
7. 利用者は、本サービスにアカウント登録、本人確認などを実施する際、機構に対して、次に掲げる事項について同意したものとみなします。
    1. 機構が、本条5項1号の規定による有効性確認に係る認証業務情報の開示を電磁的記録により行うこと。
    2. 機構が、本条5項1号の規定による有効性確認に係る利用者の署名用電子証明書の発行番号の送信を受けた場合に、当該署名用電子証明書の発行番号を利用して、当該署名用電子証明書の発行以前に当該利用者に対して発行された署名用電子証明書の発行の番号（以下、「旧番号」という。）を探索すること。
    3. 機構が、前号の探索の結果旧番号が存在する場合には、旧番号をプラットフォーム事業者に送信すること。
    4. 機構が、本項2号の探索の結果旧番号が存在しない場合には、その旨をプラットフォーム事業者に送信すること。
8. 当社は、前3項の事項に必要な限度において、当社、プラットフォーム事業者及び機構の間で利用者に関する情報が取り扱われることを保証します。
9. 利用者は、本サービスの利用にあたって当社がプラットフォーム事業者及び機構に対して提供したデータ（署名用電子証明書の有効性確認に必要となるデータ、署名用電子証明書の発行番号等これに限られません。）は、それぞれの規約等に従って取り扱われることになります。`
</script>

<style>
.wrapper__conditions{
  display: flex;
  flex-direction: column;
}

.el-scrollbar__wrap{
  height: 500px;
}
</style>